package org.example;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;

public class VacancyManager {

    // Статичний список вакансій
    public static List<Vacancies> vacanciesListUa = new ArrayList<>();
    public static List<Vacancies> vacanciesListRu = new ArrayList<>();

    // Створюємо тестові вакансії
    static {
        vacanciesListUa.add(new Vacancies("1", "male", "brwinow", "МІСЦЕ РОБОТИ: Brwinów (30 км від Варшави) \n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 28.50 зл/годину нетто для студентів до 26 років\n" +
                "- 23.01 зл/нетто для тих, хто старше 26 років\n" +
                "+ премія у розмірі 2 зл/година брутто, якщо немає пропусків.\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "- 200-280 годин на місяць\n" +
                "- зміна з 18:00 до 04:00\n" +
                "- години роботи можуть змінюватися в залежності від виробничих вимог \n" +
                "- 5-6 днів на тиждень\n" +
                "- неділя за бажанням\n" +
                "- перерви: 1 * 30 хвилин + 2 * 15 хвилин\n" +
                "\n" +
                "ЖИТЛО:\n" +
                "- 500 зл місяць\n" +
                "- квартири або будинки з дуже добрими умовами проживання\n" +
                "- кімнати 3-4х місні\n" +
                "- WI-FI, всі зручності\n" +
                "\n" +
                "Надаємо транспорт від житла до роботи - 100 зл в місяць\n" +
                "\n" +
                "ДОДАТКОВІ БОНУСИ:\n" +
                "- безкоштовні обіди\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "- 20 числа\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "- машина під'їжджає до лінії з посилками та співробітники складу завантажують машину\n" +
                "- або завантажена машина під'їжджає до лінії та співробітники розвантажують її на лінію\n" +
                "- вага посилок від 300 грам до 40 кг\n" +
                "\n" +
                "ВИТРАТИ:\n" +
                "- 260 зл - взуття, одяг (одноразово із зарплати)","DPD, Поштовий склад",true));
        vacanciesListUa.add(new Vacancies("2", "male", "warsaw", "DPD Warszawa\n" +
                "\n" +
                "Daniszewska 14\n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 28.50 зл/годину нетто для студентів до 26 років\n" +
                "- 23.01 зл/нетто для тих, хто старше 26 років\n" +
                "+ премія у розмірі 2 зл/година брутто, якщо немає пропусків.\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "- 200-280 годин на місяць\n" +
                "- зміна з 18:00 до 04:00\n" +
                "- години роботи можуть змінюватися в залежності від виробничих вимог \n" +
                "- 5-6 днів на тиждень\n" +
                "- неділя за бажанням\n" +
                "- перерви: 1 * 30 хвилин + 2 * 15 хвилин\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "- машина під'їжджає до лінії з посилками та співробітники складу завантажують машину\n" +
                "- або завантажена машина під'їжджає до лінії та співробітники розвантажують її на лінію\n" +
                "- вага посилок від 300 грам до 40 кг", "DPD, Поштовий склад",false));
        vacanciesListUa.add(new Vacancies("3", "male", "warsaw", "UPS Warszawa\n" +
                "\n" +
                "2 адреси\n" +
                "\n" +
                "Matuszewska 14\n" +
                "\n" +
                "Komitet obrony robotników 47\n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 28.58 зл/годину брутто\n" +
                "- 23.37зл/год нетто для осіб старше 26 років.\n" +
                "+ Додаток за нічну зміну  ( від 22.30-6.00) 4.67зл/год\n" +
                "+ Додаток за відвідування ( додаткові год)   до 100зл брутто           ( 0,54зл/год)\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa o pracę\n" +
                " - відповідно оплачуваний лікарняний та відпустка. Доплата за надгодини та святкові дні.\n" +
                "\n" +
                "ГРАФІК:\n" +
                "-  одна зміна ( 2.30-10.30)\n" +
                "- 5 днів на тиждень\n" +
                "- 1 перерва 20 хвилин   (є надгодини/свята +100%) ОБОВ'ЯЗКИ:\n" +
                "- завантаження розвантаження посилок\n" +
                "- сканування посилок\n" +
                "- сортування посилок", "UPS, Поштовий склад",false));
        vacanciesListUa.add(new Vacancies("4", "both", "lodz", "Medezin ( фармацептичний склад )\n" +
                "\n" +
                "Робота в одну зміну від понеділка по п'ятницю 7-15:00\n" +
                "\n" +
                "Обов'язки :\n" +
                "Пакування ліків \n" +
                "\n" +
                "\uD83D\uDCC3 Umowa zlecenia. \n" +
                "Ставка 28,50 zł брутто \n" +
                "\n" +
                "❗\uFE0FОбов'язково знання польської мови на базовому рівні \n" +
                "\n" +
                "\uD83D\uDCCDul.Ks.Janika 14 , Konstantynów Łódzki", "Medezin, Пакування ліків",false));
        vacanciesListUa.add(new Vacancies("5", "male", "strykow", "\uD83D\uDC40 Поштовий склад в місті STRYKÓW\n" +
                "\n" +
                "❓Що  треба робити?  Робота полягає в сортуванні посилок, скануванні сканером, складання на лінію. Без досвіду і знання мови (smiley) \uD83D\uDCE6\uD83D\uDCE6\uD83D\uDCE6\n" +
                "\n" +
                "\uD83D\uDD52 Графік роботи по 8-10 годин 5-6 днів на тиждень\n" +
                "Зміна з12:00 до 20:00 (залежить від кількості годин)\n" +
                "\n" +
                "\uD83D\uDCC3Робота на Umowa Zlecenia (в середньому 210-260 год)\n" +
                "\n" +
                "\uD83D\uDCB0ЯКА СТАВКА? 30 нетто до 26 років зі статусом студента\n" +
                "24,23 нетто після 26 років\n" +
                "+ можливі додаткові премії від бригадира\n" +
                "\n" +
                "\uD83C\uDFE0Надаємо супер комфортне житло в квартирах, або домах (не хостел!!)- 500 зл в місяць з зарплати. Поряд торгові центри, магазини, банки, парки\n" +
                " \n" +
                "\uD83D\uDD25Надаємо безкоштовний транспорт з Лодзі, Згежа, Стрикува, та  Гловно. Також є смачний обід на складіі, що є великим плюсом\n" +
                "\n" +
                "❤\uFE0FНа території складу є роздягальні, столова з автоматами з кавою та батончиками, мікрохвильовка, також є зона відпочинку, тенісні столи, та диванчики\n" +
                "\n" +
                "⛱Перерва 20 хв на обід + також можна вийти покурити, або  відпочити  на 5-10 хвилин, якщо немає великої завантаженості складу\n" +
                "\n" +
                "Зарплата приходить кожного місяця  на банківську карту - 20 числа\n" +
                "\n" +
                "Надаємо робочий одяг - 260 зл з першої зарплати", "DPD, Поштовий склад",true));

        vacanciesListUa.add(new Vacancies("6", "male", "swedow", "Поштовий склад м. Śwędów \uD83C\uDF06\n" +
                "Зміна⏳: \n" +
                "Від 18:00 по 8-10 годин\n" +
                "Робочі дні від Пн по Пт, можлива Сб за бажання.\n" +
                "Ставка\uD83D\uDCB0:\n" +
                "30 зл/год для студентів до 26р\n" +
                "24,23 зл для осіб старше 26 років\n" +
                "Обовʼязки\uD83D\uDCBC:\n" +
                "-завантаження розвантаження посилок з та на лінію\n" +
                "-робота зі сканером\n" +
                "-дотримання чистоти на робочому місці.\n" +
                "Оформлення\uD83D\uDCC4:\n" +
                "Umowa zlecenie \n" +
                "Житло\uD83C\uDFD8:\n" +
                "500 на місяць з зарплатні + довіз до роботи", "DPD, Поштовий склад",true));

        vacanciesListUa.add(new Vacancies("7", "both", "blonie", "Вакансія для чоловіків, жінок та сімейних пар (до 40 років) в місті Błonie (35 км від Варшави) \uD83C\uDDF5\uD83C\uDDF1 \uD83C\uDDFA\uD83C\uDDE6\n" +
                "\n" +
                "Склад харчових продуктів \uD83C\uDF4A\uD83C\uDF4C\uD83E\uDD53\uD83E\uDD5B\n" +
                "\n" +
                "Без досвіду роботи і знання мови\n" +
                "\n" +
                "\uD83D\uDD25В чому полягає робота? \n" +
                "- збір і комплектація товара за допомогою навушника або сканера;\n" +
                "-експлуатація електричного вузика;\n" +
                "-підтримання чистоти на робочому місці;\n" +
                "\n" +
                "\uD83D\uDCB0Ставка 31 злотих брутто +акорд. \n" +
                "+ доплата за нічну зміну 4 зл/год брутто (доплата йде починаючи з 22:00 до 06:00)  25.03 нетто старші 26\n" +
                "\n" +
                "Можливість заробляти навіть 6000-8000 злотих в місяць \uD83D\uDE0D\uD83D\uDE0D\n" +
                "\n" +
                "\uD83D\uDD52 Графік роботи: зміни з 14:00 - 15:00 по 8-12 год (залежить від кількості замовлень на складі)\n" +
                "(субота завжди вихідний) - кожну п'ятницю працівники знають графік на наступний тиждень)\n" +
                "\n" +
                "\uD83D\uDCC3 Офіційне працевлаштування Umowa Zlecenia (200-250 год)\n" +
                "\n" +
                "\uD83C\uDFE0 Яке житло? Надаємо комфортне житло в квартирах або будинках по 3-4 особи в кімнаті Всі зручності, поряд магазини, торгові центри - 500 зл в місяць\n" +
                "\n" +
                "\uD83E\uDDBA Надаємо робочий одяг - знімається 200 зл з першої зарплати\n" +
                "\n" +
                "Зарплата приходить на банківську карту до 20 числа кожного місяця", "Eurocash, Склад харчових продуктів",true));

        vacanciesListUa.add(new Vacancies("8", "both", "blonie", "\uD83D\uDCBC Робота на навантажувачі (UDT)– чудова можливість заробити! \uD83D\uDCB0\n" +
                "\n" +
                "(!)Ми пропонуємо чудову можливість для операторів навантажувачів UDT.\n" +
                "\n" +
                "(!)Ви отримуєте гарантовану мінімальну оплату за робочі години, але маєте можливість значно збільшити свій дохід, якщо ваша продуктивність перевищить базовий рівень!\n" +
                "\n" +
                "\uD83D\uDD39 Гарантована ставка:\n" +
                "22,69 зл/годину нетто – для працівників старше 26 років.\n" +
                "28,10 зл/годину нетто – для осіб до 26 років зі статусом студента.\n" +
                "\n" +
                "\uD83D\uDD39 Можливість заробити більше:\n" +
                "\n" +
                "- Навіть якщо за місяць кількість виконаних операцій на навантажувачі (переміщення палет з товаром) невелика, ми гарантуємо вам оплату за відпрацьовані години за вищевказаними ставками;\n" +
                "\n" +
                "- Якщо ви продуктивні та виконуєте більше роботи, ви можете заробляти на акорд, де кожна операція (зняття та повернення палети з товаром) оцінюється у 0,22 зл брутто за штуку.\n" +
                "\n" +
                "\uD83D\uDD39 Приклад розрахунку заробітку на акорд:\n" +
                "Якщо ви виконуєте 30 000 операцій на місяць (зняття і встановлення палет), ваш заробіток складе: 30 000 × 0,22 зл брутто = 6600 зл брутто.\n" +
                "Але якщо завдяки продуктивності ваш результат перевищить цю суму, наприклад до 9000 зл брутто, то ви отримуєте саме таку зарплату!\n" +
                "\n" +
                "\uD83D\uDCC8 Перевага:\n" +
                "Ваш дохід повністю у ваших руках – більше операцій, більше заробітку! Однак, навіть якщо результати менші, ваша погодинна ставка забезпечує стабільну зарплату.", "Eurocash (UDT)",false));

        vacanciesListUa.add(new Vacancies("9", "both", "kopytow", "✔\uFE0FМісце роботи: Kopytów (30 km від Варшави)\n" +
                "\n" +
                "\uD83D\uDE80 (UDT) \n" +
                "\n" +
                "Працівник складу з молочними продуктами\n" +
                "-зняття палети з регал доставляється до залодунку\n" +
                "-обслуговування та керування вузиком відловим; \n" +
                "\n" +
                "\uD83E\uDEE7Температура на складі +10 градусів\n" +
                "\n" +
                "\uD83D\uDCC6Графік роботи, з 10:00-20:00 або 12:00-22:00 з понеділка по п'ятницю (можна брати надгодини)\n" +
                "\n" +
                "\uD83D\uDCB5Ставка : 35 зл нетто - студенти до 26 років\n" +
                "28.26 зл нетто - працівники старші 26 років \n" +
                "\n" +
                "\uD83C\uDFE1Житло: комфортний будинок 3-4 людини в кімнаті, всі зручності - 500зл місяць\n" +
                "\n" +
                "\uD83D\uDE8EДоїзд до роботи громадським транспортом", "Nagel (UDT)",true));

        vacanciesListUa.add(new Vacancies("10", "both", "lodz", "МІСЦЕ РОБОТИ: Łódź , ul,Andrzeja Struga\n" +
                "\n" +
                "ПОСАДА: працівник кондитерської фабрики\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 22,69 зл/годину нетто \n" +
                "- 28,10 до 26 років зі статусом студента\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: \n" +
                "umowa zlecenie\n" +
                "\n" +
                " ГРАФІК:\n" +
                "- 240-280 годин на місяць\n" +
                "- 3 зміни по 8-12год \n" +
                "(6-14; 14-22; 22-6) є можливість брати надгодини!\n" +
                "перерва 20 хвилин, якщо зміна по 12 год то 2 перерви (20 і 10 хв) \n" +
                "- години роботи можуть змінюватися в залежності від виробничих вимог \n" +
                "- 5 днів на тиждень (додаткова субота для охочих)\n" +
                "\n" +
                "ЖИТЛО:\n" +
                "- 450 зл/місяць (із зарплати)\n" +
                "- квартири або будинки з дуже добрими умовами проживання\n" +
                "- кімнати 3-4х місні\n" +
                "- WI-FI, всі зручності\n" +
                "\n" +
                "(ЗАРПЛАТА:\n" +
                "- 20 числа\n" +
                "\n" +
                " ОБОВ'ЯЗКИ:\n" +
                "- ручне нарізання халви.\n" +
                "- розкладання халви у форми\n" +
                "- розділення халви на порції\n" +
                "- ламання сезамок\n" +
                "- сортування та пакування халви\n" +
                "\n" +
                "ВИМОГИ:\n" +
                "- акуратність\n" +
                "- дисциплінованість\n" +
                "- уважність\n" +
                "- наявність санітарної книжки\n" +
                "ЗАБОРОНЕНО:\n" +
                "- носити прикраси.\n" +
                "- використовувати штучні вії.\n" +
                "- нарощовані і фарбовані нігті.\n" +
                "- курити на території підприємства.\n" +
                "\n" +
                "ВИТРАТИ:\n" +
                "- 200 зл - робочий одяг (одноразово із зарплати)", "Unitop, Кондитерська фабрика",true));

        vacanciesListUa.add(new Vacancies("11", "female", "lodz", "ФІРМА: Aunde\n" +
                "\n" +
                "МІСЦЕ РОБОТИ: Łódź\n" +
                "\n" +
                "ПОСАДА: Швея.\n" +
                "Досвід роботи обов'язковий !!!!\n" +
                "\n" +
                " ОПЛАТА:\n" +
                "- 22,69 зл/годину нетто + 1,60 зл нетто до кожної години за виконання норми\n" +
                "- 28.10 до 26 років зі статусом студента +2зл до кожної години за виконання норми\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: \n" +
                "umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "- 200-280 годин на місяць\n" +
                "- 2 зміни по 8год \n" +
                "06:00 - 14:00\n" +
                "14:00 - 22:00\n" +
                "є можливість брати надгодини!\n" +
                "- години роботи можуть змінюватися в залежності від виробничих вимог \n" +
                "- 5-6 днів на тиждень\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "- 20 числа\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "пошиття чохлів на підлокітники, підголівники та чохли на сидіння", "Aunde, Швея",false));

        vacanciesListUa.add(new Vacancies("12", "male", "strykow", "МІСЦЕ РОБОТИ: Stryków\n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 28.58 зл/годину брутто\n" +
                "- 23.37зл/год нетто для осіб старше 26 років.\n" +
                "+ Додаток за нічну зміну  ( від 22.30-6.00) 4.67зл/год\n" +
                "+ Додаток за відвідування ( додаткові год)   до 100зл брутто           ( 0,54зл/год)\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa o pracę\n" +
                " - відповідно оплачуваний лікарняний та відпустка. Доплата за надгодини та святкові дні.\n" +
                "\n" +
                "ГРАФІК:\n" +
                "-  одна зміна ( 2.30-10.30)\n" +
                "- 5 днів на тиждень\n" +
                "- 1 перерва 20 хвилин   (є надгодини/свята +100%)\n" +
                "\n" +
                "ЖИТЛО:\n" +
                "- 500 зл місяць\n" +
                "- квартири або будинки з дуже добрими умовами проживання\n" +
                "- кімнати 3-4х місні\n" +
                "- WI-FI, всі зручності\n" +
                "\n" +
                "Надаємо транспорт від житла до роботи\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "- 10 числа\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "- завантаження розвантаження посилок\n" +
                "- сканування посилок\n" +
                "- сортування посилок", "UPS, Поштовий склад",true));

        vacanciesListUa.add(new Vacancies("13", "male", "brwinow", "МІСЦЕ РОБОТИ: Brwinów (30 км від Варшави)\n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "– 28,00 зл/годину нетто для студентів до 26 років\n" +
                "– 22,60 зл/нетто для осіб старше 26 років (24,23)\n" +
                "– премія в розмірі 2 зл/година брутто у випадку відсутності порушень.\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "– 200-280 годин на місяць\n" +
                "– зміна з 18:00 до 04:00\n" +
                "– години роботи можуть змінюватися залежно від виробничих вимог\n" +
                "– 5-6 днів на тиждень\n" +
                "– неділя за бажанням\n" +
                "– перерви: 130 хвилин + 215 хвилин\n" +
                "\n" +
                "ЖИТЛО:\n" +
                "– 500 зл на місяць\n" +
                "– квартири або будинки з дуже хорошими умовами проживання\n" +
                "– кімнати на 3-4 особи\n" +
                "– WI-FI, усі зручності\n" +
                "\n" +
                "Надаємо транспорт від житла до роботи – 100 зл на місяць\n" +
                "\n" +
                "ДОДАТКОВІ ПРЕМІЇ:\n" +
                "– безкоштовні обіди\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "– автомобіль під'їжджає до поштомату, і працівники складу завантажують авто\n" +
                "– або до лінії під'їжджає завантажений автомобіль, і працівники розвантажують його на лінію\n" +
                "– вага посилок від 300 грамів до 40 кг\n" +
                "\n" +
                "ВИТРАТИ:\n" +
                "– 260 зл – взуття, одяг (одноразово із зарплати)", "DPD, Поштовий склад",true));

        vacanciesListUa.add(new Vacancies("14", "both", "wiskitki", "Працівник складу з продуктами м. Wiskitki \uD83C\uDF06\n" +
                "\n" +
                "Зміни ⏳:\n" +
                "– від 12:00 до 22:00\n" +
                "– від 16:00 до 2-3:00\n" +
                "можна брати надгодини\n" +
                "Робочі дні від Пн по Пт, за бажання Сб\n" +
                "\n" +
                "Ставка \uD83D\uDCB0:\n" +
                "– 30 зл/год для студентів до 26 років\n" +
                "– 24,23 зл для осіб старше 26 років\n" +
                "– премії до 800 злотих залежно від виконання норми\n" +
                "\n" +
                "Обов'язки \uD83D\uDCBC:\n" +
                "– експлуатація електричних вузиків\n" +
                "– робота з планшетом (замість сканера)\n" +
                "– дотримання чистоти на робочому місці\n" +
                "\n" +
                "Оформлення \uD83D\uDCC4:\n" +
                "Umowa zlecenie\n" +
                "\n" +
                "Житло \uD83C\uDFD8\uFE0F:\n" +
                "– 500 зл на місяць із зарплатні\n" +
                "адреса Culinarna 6", "Chef Culinar, Склад продуктів",true));

        vacanciesListUa.add(new Vacancies("15", "both", "lodz", "Місце роботи: Łódź\n" +
                "Шукаємо працівників на вузики.\n" +
                "Склад харчових продуктів.\n" +
                "\n" +
                "Ставка:\n" +
                "– 28.10 зл/год + 4 зл доплата за нічні зміни нетто для студентів\n" +
                "– для людей старше 26 років 22.69 зл/год + 3.23 зл доплата за нічні зміни нетто\n" +
                "– зарплата надходить щомісяця до 20 числа на банківську карту.\n" +
                "\n" +
                "Графік роботи:\n" +
                "залежить від завантаженості складу\n" +
                "Пн-Пт\n" +
                "\n" +
                "6:00-14:00, по 8-12 годин\n" +
                "14:00-22:00\n" +
                "22:00-6:00\n" +
                "Обов'язки:\n" +
                "В чому полягає робота?\n" +
                "– збір і комплектація товару за допомогою навушника або сканера\n" +
                "– експлуатація електричного вузика\n" +
                "– підтримання чистоти на робочому місці\n" +
                "\n" +
                "Umowa zlecenia", "Eurocash, Склад харчових продуктів",false));

        vacanciesListUa.add(new Vacancies("16", "both", "kopytow", "Місце роботи: Kopytów (30 км від Варшави)\n" +
                "\n" +
                "хлопці, дівчата до 40 років\n" +
                "\n" +
                "Працівник складу з молочними продуктами\n" +
                "\n" +
                "Обов'язки:\n" +
                "– завантаження та розвантаження товарів\n" +
                "– робота зі сканером\n" +
                "Без досвіду роботи і знання мови\n" +
                "\n" +
                "Температура на складі +10 градусів\n" +
                "\n" +
                "Графік роботи: три зміни з понеділка по п'ятницю\n" +
                "06:00-14:00\n" +
                "14:00-22:00\n" +
                "22:00-06:00 (можна брати надгодини)\n" +
                "\n" +
                "Ставка:\n" +
                "– 33 зл нетто – студенти до 26 років\n" +
                "– 26.65 зл нетто – працівники старші 26 років\n" +
                "\n" +
                "Житло: комфортний будинок, 3-4 людини в кімнаті, всі зручності – 500 зл на місяць\n" +
                "\n" +
                "Umowa Zlecenia (220-260 год)", "Nagel, Склад молочних продуктів",true));

        vacanciesListUa.add(new Vacancies("17", "male", "lodz","Місце роботи: Łódż\n" +
                "Шукаємо працівників з правами UDT.\n" +
                "Склад харчових продуктів.\n" +
                "\n" +
                "Ставка:\n" +
                "– 31 зл брутто для людей старше 26 років (25.03 нетто)\n" +
                "– для студентів 31 нетто\n" +
                "– зарплата надходить щомісяця до 20 числа на банківську карту.\n" +
                "\n" +
                "Графік роботи:\n" +
                "залежить від завантаженості складу\n" +
                "Пн-Пт\n" +
                "\n" +
                "14:00-15:00, по 8-12 годин\n" +
                "22:00-06:00\n" +
                "Обов'язки:\n" +
                "– завантаження та розвантаження товарів\n" +
                "– робота зі сканером\n" +
                "\n" +
                "Житло:\n" +
                "– комфортний будинок, 3-4 людини в кімнаті, всі зручності – 450 зл на місяць\n" +
                "\n" +
                "Umowa zlecenia", "Eurocash, UDT",true));

        vacanciesListUa.add(new Vacancies("18", "both", "czestochowa","ФІРМА: SFC\n" +
                "\n" +
                "МІСЦЕ РОБОТИ: Częstochowa\n" +
                "\n" +
                "ПОСАДА: працівник складу\n" +
                "(Відділ автоклавів)\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "Ставка: 25.84 зл нетто\n" +
                "Нічні зміни: 29.84 зл нетто\n" +
                "Додаткові години: 36.00 зл нетто\n" +
                "Святкові і вихідні дні: 46.71 зл нетто\n" +
                "\n" +
                "\uD83D\uDD25 СТУДЕНТИ:\n" +
                "Ставка: 32.00 зл нетто\n" +
                "Нічні зміни: 36.00 зл нетто\n" +
                "Додаткові години: 44.58 зл нетто\n" +
                "Святкові і вихідні дні: 57.84 зл нетто\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "– 200-230 годин на місяць\n" +
                "– 3 зміни по 8-10 годин\n" +
                "06:00 - 14:00\n" +
                "14:00 - 22:00\n" +
                "22:00 - 06:00\n" +
                "– години роботи можуть змінюватися в залежності від виробничих вимог\n" +
                "– 5 днів на тиждень\n" +
                "– перерва: якщо зміна по 8 годин, то перерва 30 хвилин\n" +
                "– перерва: якщо зміна по 10 годин, то 2 перерви по 20 хвилин\n" +
                "\n" +
                "ЖИТЛО:\n" +
                "– 500 зл на місяць (вираховується із зарплати)\n" +
                "– квартири або будинки з дуже хорошими умовами проживання\n" +
                "– кімнати на 3-4 особи\n" +
                "– WI-FI, усі зручності\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "ВИТРАТИ:\n" +
                "– 250 зл – взуття, одяг (одноразово із зарплати)\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "Робота на виробництві гумових проводів\n" +
                "– обслуговування машин\n" +
                "– монтаж ручний\n" +
                "– сортування елементів\n" +
                "– ведення документації\n" +
                "\n" +
                "БОНУСИ \uD83E\uDEF6\uD83C\uDFFB:\n" +
                "– Безкоштовний доступ до басейну \uD83D\uDC99\n" +
                "– Обіди на території закладу\n" +
                "\n" +
                "Приєднуйся до нашої команди та отримай можливість захоплюючої роботи ‼\uFE0F\n", "SFC, Працівник складу",true));

        vacanciesListUa.add(new Vacancies("19", "both", "lodz","ПЕКАРНЯ В САМОМУ ЦЕНТРІ ЛОДЗЯ \uD83C\uDF1F\n" +
                "Вакансія: Оператор/Лідер лінії \uD83C\uDF1F\n" +
                "\uD83D\uDCCD Місце роботи: Łódź (ul. Tymienieckiego)\n" +
                "\n" +
                "\uD83D\uDCB0 Оплата:\n" +
                "\uD83D\uDCB8 22.69 зл/год нетто для людей старше 26 років\n" +
                "\uD83D\uDCB8 28.10 зл/год нетто для студентів до 26 років\n" +
                "\n" +
                "\uD83D\uDD52 Графік:\n" +
                "⏰ 250-280 год/місяць, 2 зміни по 12 год (05:30-17:30, 17:30-05:30), 5 днів/тиждень\n" +
                "\n" +
                "\uD83D\uDCC4 Умови:\n" +
                "\uD83D\uDCDC Umowa zlecenie\n" +
                "\uD83C\uDFE0 Житло: 500 зл/місяць, кімнати на 2-4 особи, Wi-Fi, 10-15 хвилин пішки до роботи\n" +
                "\n" +
                "\uD83D\uDD27 Обов'язки:\n" +
                "\uD83D\uDCC8 Організація робочого процесу\n" +
                "✅ Контроль якості\n" +
                "⚙\uFE0F Робота при машинах\n" +
                "\n" +
                "\uD83C\uDF81 Бонуси:\n" +
                "\uD83E\uDD50 Безкоштовна випічка на обід\n" +
                "\uD83E\uDD6F Є можливість забирати випічку додому в необмеженій кількості\n" +
                "\n" +
                "✅ Вимоги:\n" +
                "\uD83D\uDCD5 Санепід книжка (150-160 зл, оплата самостійно)\n" +
                "\uD83D\uDCAC Комунікативна польська\n" +
                "\n" +
                "\uD83D\uDCDA Навчання: Можливість підвищення кваліфікації з подальшим підвищенням ставки на 1 зл.", "Dakri Lider,Пекарня",true));

        vacanciesListUa.add(new Vacancies("20", "both", "lodz","МІСЦЕ РОБОТИ: Łódź\n" +
                "\n" +
                "ПОСАДА: Працівник пекарні\n" +
                "\n" +
                "\uD83D\uDCB0 ОПЛАТА:\n" +
                "– 22.69 зл/годину нетто\n" +
                "– 28.10 до 26 років зі статусом студента\n" +
                "– можливі премії\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "\uD83D\uDCC8 ГРАФІК:\n" +
                "– 240-280 годин на місяць\n" +
                "– 2 зміни по 10-12 год\n" +
                "05:30 - 17:30\n" +
                "17:30 - 05:30\n" +
                "– 5-6 днів на тиждень\n" +
                "– дві перерви по 20 хвилин\n" +
                "\n" +
                "\uD83D\uDD25 БОНУСИ:\n" +
                "– щоденно на обід можна брати випічку\n" +
                "– кожної п'ятниці можна брати випічку додому в необмеженій кількості\n" +
                "\n" +
                "\uD83C\uDFE0 ЖИТЛО:\n" +
                "– 500 зл/місяць (вираховується із зарплати)\n" +
                "– квартири або будинки з дуже хорошими умовами проживання\n" +
                "– кімнати на 3-4 особи\n" +
                "– WI-FI, усі зручності\n" +
                "\n" +
                "\uD83D\uDCB5 ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "\uD83D\uDEE0\uFE0F ОБОВ'ЯЗКИ:\n" +
                "\n" +
                "Жінки:\n" +
                "– викладання булок на стрічку\n" +
                "– пакування товарів у коробки\n" +
                "– додавання інгредієнтів\n" +
                "– контроль якості\n" +
                "\n" +
                "Чоловіки:\n" +
                "– укладання коробок на піддони\n" +
                "– етикетування\n" +
                "– можлива робота на холодному складі, в такому разі роботодавець забезпечує теплим одягом\n" +
                "– стояча робота\n" +
                "\n" +
                "❗\uFE0F❗\uFE0F Вимоги: актуальна санепід книжка, якщо не маєте, то детально пояснюємо як виготовити", "Dakri, Пекарня",true));

        vacanciesListUa.add(new Vacancies("21", "male", "rawa","✔\uFE0F Місце роботи: Rawa Mazowieck\n" +
                "\n" +
                "((UDT)\n" +
                "\n" +
                "Працівник складу\n" +
                "– зняття палети з регала та доставка до складу\n" +
                "– обслуговування та керування вилковим вузиком\n" +
                "\n" +
                "\uD83D\uDD52 Графік роботи:\n" +
                "І зміна: 06:00 – 14:00\n" +
                "ІІ зміна: 14:00 – 22:00\n" +
                "ІІІ зміна: 22:00 – 06:00\n" +
                "Графік складається на місяць вперед, зміни чергуються щотижня.\n" +
                "\n" +
                "\uD83D\uDCB5\uD83D\uDCB0 Ставка:\n" +
                "– 32,15 зл/год брутто\n" +
                "– 25,25 зл/год нетто до 26 років\n" +
                "– 23,98 зл/год нетто після 26 років\n" +
                "– від 4,67 зл/год брутто за нічні зміни (в залежності від місяця доплата може бути більшою)\n" +
                "– премії за виконання норми\n" +
                "\n" +
                "\uD83D\uDD25 Бонуси:\n" +
                "– карта на покупки в закладі\n" +
                "– карта на обіди з балансом 100 злотих\n" +
                "\n" +
                "\uD83C\uDFE1 Житло: комфортний будинок, 3-4 людини в кімнаті, всі зручності – 270 зл на місяць\n" +
                "\n" +
                "\uD83D\uDE8E Доїзд до роботи безкоштовно\n" +
                "\n" +
                "\uD83D\uDCDD Umowa o pracę\n" +
                "\n" +
                "\uD83D\uDCCC Зарплата надходить на банківську карту до 10 числа кожного місяця", "Pepco,Працівник складу(UDT)",true));

        vacanciesListUa.add(new Vacancies("22", "both", "rawa","МІСЦЕ РОБОТИ: Rawa Mazowiecka (60 км від Лодзі)\n" +
                "\n" +
                "Сортування товарів на виробничій лінії\n" +
                "\n" +
                "Запрошуємо відповідальних і працьовитих кандидатів на посаду комплектувальника товарів у сучасний виробничий заклад. Ви будете працювати вздовж виробничої лінії, на якій відбувається комплектація товарів.\n" +
                "\n" +
                "\uD83D\uDCB0 Ставка:\n" +
                "– 28 зл/год брутто\n" +
                "– 21.97 зл/год нетто до 26 років\n" +
                "– 21.05 зл/год нетто після 26 років\n" +
                "– від 4.67 зл/год брутто за нічні зміни (в залежності від місяця доплата може бути більшою)\n" +
                "– премії за виконання норми\n" +
                "\n" +
                "\uD83D\uDD25 Бонуси:\n" +
                "– карта на закупи в закладі\n" +
                "– карта на обіди з балансом 100 злотих\n" +
                "\n" +
                "\uD83C\uDFE0 ЖИТЛО:\n" +
                "– 270 зл на місяць\n" +
                "\n" +
                "\uD83D\uDCC3 Umowa o pracę (160-168 год)\n" +
                "\n" +
                "\uD83D\uDEE0\uFE0F ОБОВ'ЯЗКИ:\n" +
                "– розміщення товарів, що спадають по виробничій лінії, у спеціальні контейнери\n" +
                "– акуратне складання товарів на палети згідно з установленими стандартами\n" +
                "– обмотування палет із товарами стретч-плівкою для забезпечення надійного зберігання і транспортування\n" +
                "\n" +
                "\uD83D\uDD52 Графік роботи:\n" +
                "І зміна: 06:00 – 14:00\n" +
                "ІІ зміна: 14:00 – 22:00\n" +
                "ІІІ зміна: 22:00 – 06:00\n" +
                "Графік складається на місяць вперед, зміни приходять щотижня\n" +
                "\n" +
                "❗\uFE0F Що ми пропонуємо:\n" +
                "– стабільну заробітну плату\n" +
                "– дружній колектив і комфортні умови праці\n" +
                "– можливість кар’єрного зростання\n" +
                "\n" +
                "❗\uFE0F Вимоги до кандидатів:\n" +
                "– відповідальність і уважність до деталей\n" +
                "– здатність працювати в команді", "Pepco, Сортування товарів",true));

        vacanciesListUa.add(new Vacancies("23", "male", "radomsko","*Працівник складу товарів для дому JYSK*\n" +
                "Склад спеціалізується на пакуванні, комплектації , збору за допомогою сканера побутових товарів\n" +
                "\n" +
                "*КОРОТКО ПРО ОСНОВНЕ*\n" +
                "\uD83D\uDCB5 Заробітна плата 27 zł брутто;\n" +
                "\uD83D\uDCC8 Робота по 8-12 годин в день;\n" +
                "\uD83D\uDC6C Для чоловіків до 45 років;\n" +
                "\uD83E\uDD1D Офіційне працевлаштування за договором Umowa o pracę;\n" +
                "\n" +
                "\uD83D\uDDC2 *ВИМОГИ*\n" +
                "◈ чоловіки;\n" +
                "◈ вік до 45 років;\n" +
                "◈ Біо або „укр. паспорт+Pesel”;\n" +
                "◈ фізично здорові;\n" +
                "\n" +
                "\uD83D\uDCB3 *ЗАРОБІТНА ПЛАТА*\n" +
                "\n" +
                "◈ Ставка: 27 zł брутто + 25% премія\n" +
                "◈ за нічний час: +20% до ставки\n" +
                "◈ за роботу в неділю та святкові дні: +100%до ставки\n" +
                "◈ за роботу у понаднормовий час: +50% до ставки\n" +
                "◈ Ставка на 1 zł вища для працівників до 26 років.\n" +
                "◈ Щотижневі аванси\n" +
                "\n" +
                "\uD83D\uDCC8 *ГРАФІК РОБОТИ*\n" +
                "◈ в 3 зміни (6-14, 14-22, 22-6);\n" +
                "◈ + надгодини можна брати ;\n" +
                "\n" +
                "\uD83D\uDCDC *ОБОВ’ЯЗКИ*\n" +
                "◈ прийом товару\n" +
                "◈ комплектування на піддони\n" +
                "◈ завантаженням товару\n" +
                "◈ робота зі сканером, всі працівники користуються навантажувачами (до 30см.)\n" +
                "◈ Особи з порушенням зору мають мати окуляри.\n" +
                "\n" +
                "\uD83C\uDFE0*ПРОЖИВАННЯ*\n" +
                "◈ надається роботодавцем;\n" +
                "◈ комунальні послуги 260 зл/міс;\n" +
                "◈ працівники живуть в будинках, квартирах;\n" +
                "◈ гарні умови, в кімнаті проживає 2-4 людини;\n" +
                "◈ є все необхідне для життя і відпочинку, WI-FI, холодильник;\n" +
                "◈ До роботи: міським автобус курсує на 3 зміни.\n" +
                "\n" +
                "ℹ\uFE0F *ДОДАТКОВІ УМОВИ*\n" +
                "◈ Святкові сніданок/вечеря, солодкі подарунки на День Святого Миколая\n" +
                "◈ за 7zł обіди (перше, друге), кава/чай безкоштовні. Роботодавець дофінансовує 17zł.\n" +
                "◈ Оплачувана відпустка та лікарняні.\n" +
                "\n" +
                "\uD83D\uDCCD *МІСЦЕ РОБОТИ*\n" +
                "◈ м. Radomsko (40км від Ченстохова, 100 км від Лодзя)", "Jusk, Пакування товарів",true));

        vacanciesListUa.add(new Vacancies("24", "male", "wroclaw","\nDPD Wroclaw adresa\n" +
                "Oddział WR1\n" +
                "51-317 Wrocław, ul. Bierutowska 81\n" +
                "\n" +
                "ПОСАДА: працівник поштового складу\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "- 28.50 зл/годину нетто для студентів до 26 років\n" +
                "- 23.01 зл/нетто для тих, хто старше 26 років\n" +
                "+ премія у розмірі 2 зл/година брутто, якщо немає пропусків.\n" +
                "\n" +
                "ВИД ПРАЦЕВЛАШТУВАННЯ: umowa zlecenie\n" +
                "\n" +
                "ГРАФІК:\n" +
                "- 200-280 годин на місяць\n" +
                "- зміна з 18:00 до 04:00\n" +
                "- години роботи можуть змінюватися в залежності від виробничих вимог \n" +
                "- 5-6 днів на тиждень\n" +
                "- неділя за бажанням\n" +
                "- перерви: 1 * 30 хвилин + 2 * 15 хвилин\n" +
                "\n" +
                " ЖИТЛО:\n" +
                "- 500 зл місяць\n" +
                "- квартири або будинки з дуже добрими умовами проживання\n" +
                "- кімнати 3-4х місні\n" +
                "- WI-FI, всі зручності\n" +
                "\n" +
                "Надаємо транспорт від житла до роботи - 100 зл в місяць\n" +
                "\n" +
                "ДОДАТКОВІ БОНУСИ:\n" +
                "- безкоштовні обіди\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "- 20 числа\n" +
                "\n" +
                "ОБОВ'ЯЗКИ:\n" +
                "- машина під'їжджає до лінії з посилками та співробітники складу завантажують машину\n" +
                "- або завантажена машина під'їжджає до лінії та співробітники розвантажують її на лінію\n" +
                "- вага посилок від 300 грам до 40 кг\n" +
                "\n" +
                "ВИТРАТИ:\n" +
                "- 260 зл - взуття, одяг (одноразово із зарплати)", "DPD, Поштовий склад",true));









        vacanciesListRu.add(new Vacancies("1", "male", "brwinow", "МЕСТО РАБОТЫ: Brwinów (30 км от Варшавы)\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА: – 28.50 зл/час нетто для студентов до 26 лет\n" +
                "– 23.01 зл/нетто для тех, кто старше 26 лет\n" +
                "– премия в размере 2 зл/час брутто, если нет пропусков.\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa zlecenie\n" +
                "\n" +
                "ГРАФИК: – 200-280 часов в месяц\n" +
                "– смена с 18:00 до 04:00\n" +
                "– рабочие часы могут меняться в зависимости от производственных требований\n" +
                "– 5-6 дней в неделю\n" +
                "– воскресенье по желанию\n" +
                "– перерывы: 1 * 30 минут + 2 * 15 минут\n" +
                "\n" +
                "ЖИЛЬЁ: – 500 зл в месяц\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты 3-4х местные\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "Предоставляем транспорт от жилья до работы – 100 зл в месяц\n" +
                "\n" +
                "ДОПОЛНИТЕЛЬНЫЕ БОНУСЫ: – бесплатные обеды\n" +
                "\n" +
                "ЗАРПЛАТА: – 20 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – машина подъезжает к линии с посылками, и сотрудники склада загружают машину\n" +
                "– или загруженная машина подъезжает к линии, и сотрудники разгружают её на линию\n" +
                "– вес посылок от 300 грамм до 40 кг\n" +
                "\n" +
                "РАСХОДЫ: – 260 зл – обувь, одежда (однократно из зарплаты)", "DPD, Почтовый склад",true));
        vacanciesListRu.add(new Vacancies("2", "male", "warsaw", "DPD Warszawa\n" +
                "\n" +
                "Daniszewska 14\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА: – 28.50 зл/час нетто для студентов до 26 лет\n" +
                "– 23.01 зл/нетто для тех, кто старше 26 лет\n" +
                "– премия в размере 2 зл/час брутто, если нет пропусков.\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa zlecenie\n" +
                "\n" +
                "ГРАФИК: – 200-280 часов в месяц\n" +
                "– смена с 18:00 до 04:00\n" +
                "– рабочие часы могут меняться в зависимости от производственных требований\n" +
                "– 5-6 дней в неделю\n" +
                "– воскресенье по желанию\n" +
                "– перерывы: 1 * 30 минут + 2 * 15 минут\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – машина подъезжает к линии с посылками, и сотрудники склада загружают машину\n" +
                "– или загруженная машина подъезжает к линии, и сотрудники разгружают её на линию\n" +
                "– вес посылок от 300 грамм до 40 кг", "DPD, Почтовый склад",false));
        vacanciesListRu.add(new Vacancies("3", "male", "warsaw", "UPS Warszawa\n" +
                "\n" +
                "2 адреса\n" +
                "\n" +
                "Matuszewska 14\n" +
                "\n" +
                "Komitet obrony robotników 47\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА: – 28.58 зл/час брутто\n" +
                "– 23.37 зл/час нетто для лиц старше 26 лет\n" +
                "– Доплата за ночную смену (с 22:30 до 6:00) 4.67 зл/час\n" +
                "– Доплата за посещаемость (дополнительные часы) до 100 зл брутто (0.54 зл/час)\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa o pracę\n" +
                "– оплачиваемый больничный и отпуск. Доплата за сверхурочные и праздничные дни.\n" +
                "\n" +
                "ГРАФИК: – одна смена (с 2:30 до 10:30)\n" +
                "– 5 дней в неделю\n" +
                "– 1 перерыв 20 минут (есть сверхурочные/праздничные +100%)\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – загрузка и разгрузка посылок\n" +
                "– сканирование посылок\n" +
                "– сортировка посылок", "UPS, Работник почтового склада",false));

        vacanciesListRu.add(new Vacancies("4", "both", "lodz", "Medezin (фармацевтический склад)\n" +
                "\n" +
                "Работа в одну смену с понедельника по пятницу 7-15:00\n" +
                "\n" +
                "Обязанности: – упаковка лекарств\n" +
                "\n" +
                "\uD83D\uDCC3 Umowa zlecenia.\n" +
                "Ставка 28,50 zł брутто\n" +
                "\n" +
                "❗\uFE0FОбязательно знание польского языка на базовом уровне\n" +
                "\n" +
                "\uD83D\uDCCDul. Ks. Janika 14, Konstantynów Łódzki", "Medezin, Упаковка лекарств",false));

        vacanciesListRu.add(new Vacancies("5", "male", "strykow", "\uD83D\uDC40 Почтовый склад в городе STRYKÓW\n" +
                "\n" +
                "❓Что нужно делать? Работа заключается в сортировке посылок, сканировании сканером, укладке на линию. Без опыта и знания языка (smiley) \uD83D\uDCE6\uD83D\uDCE6\uD83D\uDCE6\n" +
                "\n" +
                "\uD83D\uDD52 График работы по 8-10 часов 5-6 дней в неделю\n" +
                "Смена с 12:00 до 20:00 (зависит от количества часов)\n" +
                "\n" +
                "\uD83D\uDCC3 Работа на Umowa Zlecenia (в среднем 210-260 часов)\n" +
                "\n" +
                "\uD83D\uDCB0КАКАЯ СТАВКА? 30 нетто до 26 лет со статусом студента\n" +
                "24,23 нетто после 26 лет\n" +
                "\n" +
                "возможны дополнительные премии от бригадира\n" +
                "\uD83C\uDFE0Предоставляем супер комфортное жильё в квартирах или домах (не хостел!!) - 500 зл в месяц из зарплаты. Рядом торговые центры, магазины, банки, парки\n" +
                "\n" +
                "\uD83D\uDD25Предоставляем бесплатный транспорт из Лодзи, Згежа, Стрыкува и Гловно. Также есть вкусный обед на складе, что является большим плюсом\n" +
                "\n" +
                "❤\uFE0FНа территории склада есть раздевалки, столовая с автоматами с кофе и батончиками, микроволновка, также есть зона отдыха, теннисные столы и диванчики\n" +
                "\n" +
                "⛱Перерыв 20 мин на обед + также можно выйти покурить или отдохнуть на 5-10 минут, если нет большой загруженности склада\n" +
                "\n" +
                "Зарплата приходит каждый месяц на банковскую карту - 20 числа\n" +
                "\n" +
                "Предоставляем рабочую одежду - 260 зл с первой зарплаты", "DPD, Почтовый склад",true));

        vacanciesListRu.add(new Vacancies("6", "male", "swedow", "Почтовый склад г. Śwędów \uD83C\uDF06\n" +
                "\n" +
                "Смена ⏳:\n" +
                "От 18:00 по 8-10 часов\n" +
                "Рабочие дни с Пн по Пт, возможна Сб по желанию.\n" +
                "\n" +
                "Ставка \uD83D\uDCB0:\n" +
                "30 зл/час для студентов до 26 лет\n" +
                "24,23 зл для лиц старше 26 лет\n" +
                "\n" +
                "Обязанности \uD83D\uDCBC:\n" +
                "– загрузка и разгрузка посылок с и на линию\n" +
                "– работа со сканером\n" +
                "– соблюдение чистоты на рабочем месте.\n" +
                "\n" +
                "Оформление \uD83D\uDCC4:\n" +
                "Umowa zlecenie\n" +
                "\n" +
                "Жильё \uD83C\uDFD8:\n" +
                "500 зл в месяц из зарплаты + доставка до работы", "DPD, Почтовый склад",true));

        vacanciesListRu.add(new Vacancies("7", "both", "blonie", "Вакансия для мужчин, женщин и семейных пар (до 40 лет) в городе Błonie (35 км от Варшавы) \uD83C\uDDF5\uD83C\uDDF1 \uD83C\uDDFA\uD83C\uDDE6\n" +
                "\n" +
                "Склад пищевых продуктов \uD83C\uDF4A\uD83C\uDF4C\uD83E\uDD53\uD83E\uDD5B\n" +
                "\n" +
                "Без опыта работы и знания языка\n" +
                "\n" +
                "\uD83D\uDD25В чём заключается работа?\n" +
                "– сбор и комплектация товара с помощью наушника или сканера\n" +
                "– эксплуатация электрического тележки\n" +
                "– поддержание чистоты на рабочем месте\n" +
                "\n" +
                "\uD83D\uDCB0Ставка 31 злотый брутто + аккорд\n" +
                "\n" +
                "доплата за ночную смену 4 зл/час брутто (доплата начисляется с 22:00 до 06:00) 25.03 нетто старше 26 лет\n" +
                "Возможность зарабатывать даже 6000-8000 злотых в месяц \uD83D\uDE0D\uD83D\uDE0D\n" +
                "\n" +
                "\uD83D\uDD52 График работы: смены с 14:00 - 15:00 по 8-12 часов (зависит от количества заказов на складе)\n" +
                "(суббота всегда выходной) - каждую пятницу сотрудники узнают график на следующую неделю\n" +
                "\n" +
                "\uD83D\uDCC3 Официальное трудоустройство Umowa Zlecenia (200-250 часов)\n" +
                "\n" +
                "\uD83C\uDFE0 Какое жильё? Предоставляем комфортное жильё в квартирах или домах по 3-4 человека в комнате. Все удобства, рядом магазины, торговые центры - 500 зл в месяц\n" +
                "\n" +
                "\uD83E\uDDBA Предоставляем рабочую одежду - снимается 200 зл с первой зарплаты\n" +
                "\n" +
                "Зарплата поступает на банковскую карту до 20 числа каждого месяца", "Eurocash, Склад продуктов",true));


        vacanciesListRu.add(new Vacancies("8", "both", "blonie", "\uD83D\uDCBC Работа на погрузчике (UDT) – отличная возможность заработать! \uD83D\uDCB0\n" +
                "\n" +
                "(!) Мы предлагаем прекрасную возможность для операторов погрузчиков UDT.\n" +
                "\n" +
                "(!) Вы получаете гарантированную минимальную оплату за рабочие часы, но имеете возможность значительно увеличить свой доход, если ваша продуктивность превысит базовый уровень!\n" +
                "\n" +
                "\uD83D\uDD39 Гарантированная ставка:\n" +
                "22,69 зл/час нетто – для работников старше 26 лет.\n" +
                "28,10 зл/час нетто – для лиц до 26 лет со статусом студента.\n" +
                "\n" +
                "\uD83D\uDD39 Возможность заработать больше:\n" +
                "\n" +
                "– Даже если за месяц количество выполненных операций на погрузчике (перемещение паллет с товаром) невелико, мы гарантируем вам оплату за отработанные часы по вышеуказанным ставкам;\n" +
                "\n" +
                "– Если вы продуктивны и выполняете больше работы, вы можете зарабатывать на аккорд, где каждая операция (снятие и возврат паллеты с товаром) оценивается в 0,22 зл брутто за штуку.\n" +
                "\n" +
                "\uD83D\uDD39 Пример расчета заработка на аккорд:\n" +
                "Если вы выполняете 30 000 операций в месяц (снятие и установка паллет), ваш заработок составит: 30 000 × 0,22 зл брутто = 6600 зл брутто.\n" +
                "Но если благодаря продуктивности ваш результат превысит эту сумму, например, до 9000 зл брутто, то вы получите именно такую зарплату!\n" +
                "\n" +
                "\uD83D\uDCC8 Преимущество:\n" +
                "Ваш доход полностью в ваших руках – больше операций, больше заработка! Однако, даже если результаты меньше, ваша почасовая ставка обеспечивает стабильную зарплату.", "Eurocash, UDT",false));


        vacanciesListRu.add(new Vacancies("9", "both", "kopytow", "✔\uFE0F Место работы: Kopytów (30 км от Варшавы)\n" +
                "\n" +
                "\uD83D\uDE80 (UDT)\n" +
                "\n" +
                "Работник склада с молочными продуктами\n" +
                "– снятие паллеты с регала и доставка к складу\n" +
                "– обслуживание и управление складской тележкой\n" +
                "\n" +
                "\uD83E\uDEE7 Температура на складе +10 градусов\n" +
                "\n" +
                "\uD83D\uDCC6 График работы: с 10:00-20:00 или 12:00-22:00 с понедельника по пятницу (можно брать сверхурочные)\n" +
                "\n" +
                "\uD83D\uDCB5 Ставка: 35 зл нетто – студенты до 26 лет\n" +
                "28.26 зл нетто – работники старше 26 лет\n" +
                "\n" +
                "\uD83C\uDFE1 Жильё: комфортный дом, 3-4 человека в комнате, все удобства – 500 зл в месяц\n" +
                "\n" +
                "\uD83D\uDE8E Доезд до работы общественным транспортом", "Nagel, UDT",true));

        vacanciesListRu.add(new Vacancies("10", "both", "lodz", "МЕСТО РАБОТЫ: Łódź, ul. Andrzeja Struga\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник кондитерской фабрики\n" +
                "\n" +
                "ОПЛАТА: – 22,69 зл/час нетто\n" +
                "– 28,10 до 26 лет со статусом студента\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "ГРАФИК: – 240-280 часов в месяц\n" +
                "– 3 смены по 8-12 часов\n" +
                "(6-14; 14-22; 22-6) есть возможность брать сверхурочные!\n" +
                "перерыв 20 минут, если смена по 12 часов, то 2 перерыва (20 и 10 мин)\n" +
                "– рабочие часы могут меняться в зависимости от производственных требований\n" +
                "– 5 дней в неделю (дополнительная суббота для желающих)\n" +
                "\n" +
                "ЖИЛЬЁ: – 450 зл/месяц (вычитается из зарплаты)\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты на 3-4 человека\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "ЗАРПЛАТА: – 20 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – ручная нарезка халвы\n" +
                "– раскладывание халвы по формам\n" +
                "– деление халвы на порции\n" +
                "– ломка сезамок\n" +
                "– сортировка и упаковка халвы\n" +
                "\n" +
                "ТРЕБОВАНИЯ: – аккуратность\n" +
                "– дисциплинированность\n" +
                "– внимательность\n" +
                "– наличие санитарной книжки\n" +
                "\n" +
                "ЗАПРЕЩЕНО: – носить украшения\n" +
                "– использовать искусственные ресницы\n" +
                "– наращенные и окрашенные ногти\n" +
                "– курить на территории предприятия\n" +
                "\n" +
                "РАСХОДЫ: – 200 зл – рабочая одежда (единоразово вычитается из зарплаты)", "Unitop, Кондитерская фабрика",true));

        vacanciesListRu.add(new Vacancies("11", "female", "lodz", "ФИРМА: Aunde\n" +
                "\n" +
                "МЕСТО РАБОТЫ: Łódź\n" +
                "\n" +
                "ДОЛЖНОСТЬ: Швея.\n" +
                "Опыт работы обязателен!!!!\n" +
                "\n" +
                "ОПЛАТА: – 22,69 зл/час нетто + 1,60 зл нетто к каждому часу за выполнение нормы\n" +
                "– 28.10 до 26 лет со статусом студента + 2 зл к каждому часу за выполнение нормы\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "ГРАФИК: – 200-280 часов в месяц\n" +
                "– 2 смены по 8 часов\n" +
                "06:00 - 14:00\n" +
                "14:00 - 22:00\n" +
                "есть возможность брать сверхурочные!\n" +
                "– рабочие часы могут меняться в зависимости от производственных требований\n" +
                "– 5-6 дней в неделю\n" +
                "\n" +
                "ЗАРПЛАТА: – 20 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ:\n" +
                "пошив чехлов на подлокотники, подголовники и чехлы на сиденья", "Aunde ,Швея",false));

        vacanciesListRu.add(new Vacancies("12", "male", "strykow", "МЕСТО РАБОТЫ: Stryków\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА: – 28.58 зл/час брутто\n" +
                "– 23.37 зл/час нетто для лиц старше 26 лет\n" +
                "\n" +
                "Доплата за ночную смену (с 22:30 до 6:00) 4.67 зл/час\n" +
                "Доплата за посещаемость (дополнительные часы) до 100 зл брутто (0,54 зл/час)\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa o pracę\n" +
                "– оплачиваемый больничный и отпуск. Доплата за сверхурочные и праздничные дни.\n" +
                "\n" +
                "ГРАФИК: – одна смена (2:30-10:30)\n" +
                "– 5 дней в неделю\n" +
                "– 1 перерыв 20 минут (есть сверхурочные/праздничные +100%)\n" +
                "\n" +
                "ЖИЛЬЁ: – 500 зл в месяц\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты на 3-4 человека\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "Предоставляем транспорт от жилья до работы\n" +
                "\n" +
                "ЗАРПЛАТА: – 10 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – загрузка и разгрузка посылок\n" +
                "– сканирование посылок\n" +
                "– сортировка посылок", "DPD, Почтовый склад",true));


        vacanciesListRu.add(new Vacancies("13", "male", "brwinow", "МЕСТО РАБОТЫ: Brwinów (30 км от Варшавы)\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "– 28,00 зл/час нетто для студентов до 26 лет\n" +
                "– 22,60 зл/нетто для лиц старше 26 лет (24,23)\n" +
                "– премия в размере 2 зл/час брутто в случае отсутствия нарушений.\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa zlecenie\n" +
                "\n" +
                "ГРАФИК:\n" +
                "– 200-280 часов в месяц\n" +
                "– смена с 18:00 до 04:00\n" +
                "– рабочие часы могут варьироваться в зависимости от производственных требований\n" +
                "– 5-6 дней в неделю\n" +
                "– воскресенье по желанию\n" +
                "– перерывы: 130 минут + 215 минут\n" +
                "\n" +
                "ЖИЛЬЁ:\n" +
                "– 500 зл в месяц\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты на 3-4 человека\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "Предоставляем транспорт от жилья до работы – 100 зл в месяц\n" +
                "\n" +
                "ДОПОЛНИТЕЛЬНЫЕ ПРЕМИИ:\n" +
                "– бесплатные обеды\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ:\n" +
                "– автомобиль подъезжает к почтомату, и сотрудники склада загружают авто\n" +
                "– либо к линии подъезжает загруженный автомобиль, и сотрудники разгружают его на линию\n" +
                "– вес посылок от 300 граммов до 40 кг\n" +
                "\n" +
                "РАСХОДЫ:\n" +
                "– 260 зл – обувь, одежда (однократно из зарплаты)", "DPD, Почтовый склад",true));

        vacanciesListRu.add(new Vacancies("14", "both", "wiskitki", "Работник склада с продуктами г. Wiskitki \uD83C\uDF06\n" +
                "\n" +
                "Смены ⏳:\n" +
                "– от 12:00 до 22:00\n" +
                "– от 16:00 до 2-3:00\n" +
                "можно брать сверхурочные\n" +
                "Рабочие дни с Пн по Пт, по желанию Сб\n" +
                "\n" +
                "Ставка \uD83D\uDCB0:\n" +
                "– 30 зл/час для студентов до 26 лет\n" +
                "– 24,23 зл для лиц старше 26 лет\n" +
                "– премии до 800 злотых в зависимости от выполнения нормы\n" +
                "\n" +
                "Обязанности \uD83D\uDCBC:\n" +
                "– эксплуатация электрических узков\n" +
                "– работа с планшетом (вместо сканера)\n" +
                "– соблюдение чистоты на рабочем месте\n" +
                "\n" +
                "Оформление \uD83D\uDCC4:\n" +
                "Umowa zlecenie\n" +
                "\n" +
                "Жилье \uD83C\uDFD8\uFE0F:\n" +
                "– 500 зл в месяц из зарплаты\n" +
                "адрес Culinarna 6", "Chef Culinar, Склад продуктов",true));

        vacanciesListRu.add(new Vacancies("15", "both", "lodz", "Место работы: Łódź\n" +
                "Ищем сотрудников на тележки.\n" +
                "Склад пищевых продуктов.\n" +
                "\n" +
                "Ставка:\n" +
                "– 28.10 зл/час + 4 зл доплата за ночные смены нетто для студентов\n" +
                "– для лиц старше 26 лет 22.69 зл/час + 3.23 зл доплата за ночные смены нетто\n" +
                "– зарплата поступает ежемесячно до 20 числа на банковскую карту.\n" +
                "\n" +
                "График работы:\n" +
                "зависит от загруженности склада\n" +
                "Пн-Пт\n" +
                "\n" +
                "6:00-14:00, по 8-12 часов\n" +
                "14:00-22:00\n" +
                "22:00-6:00\n" +
                "Обязанности:\n" +
                "В чём заключается работа?\n" +
                "– сбор и комплектация товара с помощью наушника или сканера\n" +
                "– эксплуатация электрической тележки\n" +
                "– поддержание чистоты на рабочем месте\n" +
                "\n" +
                "Umowa zlecenia\n", "Eurocash, Склад пищевых продуктов",false));

        vacanciesListRu.add(new Vacancies("16", "both", "kopytow", "Место работы: Kopytów (30 км от Варшавы)\n" +
                "\n" +
                "мужчины, женщины до 40 лет\n" +
                "\n" +
                "Работник склада с молочными продуктами\n" +
                "\n" +
                "Обязанности:\n" +
                "– загрузка и разгрузка товаров\n" +
                "– работа со сканером\n" +
                "Без опыта работы и знания языка\n" +
                "\n" +
                "Температура на складе +10 градусов\n" +
                "\n" +
                "График работы: три смены с понедельника по пятницу\n" +
                "06:00-14:00\n" +
                "14:00-22:00\n" +
                "22:00-06:00 (можно брать сверхурочные)\n" +
                "\n" +
                "Ставка:\n" +
                "– 33 зл нетто – студенты до 26 лет\n" +
                "– 26.65 зл нетто – сотрудники старше 26 лет\n" +
                "\n" +
                "Жильё: комфортный дом, 3-4 человека в комнате, все удобства – 500 зл в месяц\n" +
                "\n" +
                "Umowa Zlecenia (220-260 часов)", "Nagel, Склад молочных продуктов",true));

        vacanciesListRu.add(new Vacancies("17", "male", "lodz","Місце роботи: Łódż\n" +
                "Шукаємо працівників з правами UDT.\n" +
                "Склад харчових продуктів.\n" +
                "\n" +
                "Ставка:\n" +
                "– 31 зл брутто для людей старше 26 років (25.03 нетто)\n" +
                "– для студентів 31 нетто\n" +
                "– зарплата надходить щомісяця до 20 числа на банківську карту.\n" +
                "\n" +
                "Графік роботи:\n" +
                "залежить від завантаженості складу\n" +
                "Пн-Пт\n" +
                "\n" +
                "14:00-15:00, по 8-12 годин\n" +
                "22:00-06:00\n" +
                "Обов'язки:\n" +
                "– завантаження та розвантаження товарів\n" +
                "– робота зі сканером\n" +
                "\n" +
                "Житло:\n" +
                "– комфортний будинок, 3-4 людини в кімнаті, всі зручності – 450 зл на місяць\n" +
                "\n" +
                "Umowa zlecenia\n" +
                "\n" +
                "Место работы: Łódż\n" +
                "Ищем сотрудников с правами UDT.\n" +
                "Склад пищевых продуктов.\n" +
                "\n" +
                "Ставка:\n" +
                "– 31 зл брутто для лиц старше 26 лет (25.03 нетто)\n" +
                "– для студентов 31 нетто\n" +
                "– зарплата поступает ежемесячно до 20 числа на банковскую карту.\n" +
                "\n" +
                "График работы:\n" +
                "зависит от загруженности склада\n" +
                "Пн-Пт\n" +
                "\n" +
                "14:00-15:00, по 8-12 часов\n" +
                "22:00-06:00\n" +
                "Обязанности:\n" +
                "– загрузка и разгрузка товаров\n" +
                "– работа со сканером\n" +
                "\n" +
                "Жильё:\n" +
                "– комфортный дом, 3-4 человека в комнате, все удобства – 450 зл в месяц\n" +
                "\n" +
                "Umowa zlecenia", "Eurocash, UDT",true));

        vacanciesListRu.add(new Vacancies("18", "both", "czestochowa","ФИРМА: SFC\n" +
                "\n" +
                "МЕСТО РАБОТЫ: Częstochowa\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник склада\n" +
                "(Отдел автоклавов)\n" +
                "\n" +
                "ОПЛАТА:\n" +
                "Ставка: 25.84 зл нетто\n" +
                "Ночные смены: 29.84 зл нетто\n" +
                "Дополнительные часы: 36.00 зл нетто\n" +
                "Праздничные и выходные дни: 46.71 зл нетто\n" +
                "\n" +
                "\uD83D\uDD25 СТУДЕНТЫ:\n" +
                "Ставка: 32.00 зл нетто\n" +
                "Ночные смены: 36.00 зл нетто\n" +
                "Дополнительные часы: 44.58 зл нетто\n" +
                "Праздничные и выходные дни: 57.84 зл нетто\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "ГРАФИК:\n" +
                "– 200-230 часов в месяц\n" +
                "– 3 смены по 8-10 часов\n" +
                "06:00 - 14:00\n" +
                "14:00 - 22:00\n" +
                "22:00 - 06:00\n" +
                "– рабочие часы могут варьироваться в зависимости от производственных требований\n" +
                "– 5 дней в неделю\n" +
                "– перерыв: если смена по 8 часов, то перерыв 30 минут\n" +
                "– перерыв: если смена по 10 часов, то 2 перерыва по 20 минут\n" +
                "\n" +
                "ЖИЛЬЁ:\n" +
                "– 500 зл в месяц (вычитается из зарплаты)\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты на 3-4 человека\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "РАСХОДЫ:\n" +
                "– 250 зл – обувь, одежда (однократно вычитается из зарплаты)\n" +
                "\n" +
                "ОБЯЗАННОСТИ:\n" +
                "Работа на производстве резиновых проводов\n" +
                "– обслуживание машин\n" +
                "– ручной монтаж\n" +
                "– сортировка элементов\n" +
                "– ведение документации\n" +
                "\n" +
                "БОНУСЫ \uD83E\uDEF6\uD83C\uDFFB:\n" +
                "– Бесплатный доступ к бассейну \uD83D\uDC99\n" +
                "– Обеды на территории заведения\n" +
                "\n" +
                "Присоединяйся к нашей команде и получи возможность увлекательной работы ‼\uFE0F", "SFC, Работник склада",true));

        vacanciesListRu.add(new Vacancies("19", "both", "lodz","ПЕКАРНЯ В САМОМ ЦЕНТРЕ ЛОДЗИ \uD83C\uDF1F\n" +
                "Вакансия: Оператор/Лидер линии \uD83C\uDF1F\n" +
                "\uD83D\uDCCD Место работы: Łódź (ul. Tymienieckiego)\n" +
                "\n" +
                "\uD83D\uDCB0 Оплата:\n" +
                "\uD83D\uDCB8 22.69 зл/час нетто для лиц старше 26 лет\n" +
                "\uD83D\uDCB8 28.10 зл/час нетто для студентов до 26 лет\n" +
                "\n" +
                "\uD83D\uDD52 График:\n" +
                "⏰ 250-280 часов/месяц, 2 смены по 12 часов (05:30-17:30, 17:30-05:30), 5 дней/неделя\n" +
                "\n" +
                "\uD83D\uDCC4 Условия:\n" +
                "\uD83D\uDCDC Umowa zlecenie\n" +
                "\uD83C\uDFE0 Жильё: 500 зл/месяц, комнаты на 2-4 человека, Wi-Fi, 10-15 минут пешком до работы\n" +
                "\n" +
                "\uD83D\uDD27 Обязанности:\n" +
                "\uD83D\uDCC8 Организация рабочего процесса\n" +
                "✅ Контроль качества\n" +
                "⚙\uFE0F Работа на машинах\n" +
                "\n" +
                "\uD83C\uDF81 Бонусы:\n" +
                "\uD83E\uDD50 Бесплатная выпечка на обед\n" +
                "\uD83E\uDD6F Возможность забирать выпечку домой в неограниченном количестве\n" +
                "\n" +
                "✅ Требования:\n" +
                "\uD83D\uDCD5 Санэпид книжка (150-160 зл, оплата самостоятельно)\n" +
                "\uD83D\uDCAC Коммуникативный польский\n" +
                "\n" +
                "\uD83D\uDCDA Обучение: Возможность повышения квалификации с последующим повышением ставки на 1 зл.", "Dakri Lider,Пекарня",true));

        vacanciesListRu.add(new Vacancies("20", "both", "lodz","МЕСТО РАБОТЫ: Łódź\n" +
                "\n" +
                "ДОЛЖНОСТЬ: Работник пекарни\n" +
                "\n" +
                "\uD83D\uDCB0 ОПЛАТА:\n" +
                "– 22.69 зл/час нетто\n" +
                "– 28.10 до 26 лет со статусом студента\n" +
                "– возможные премии\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА:\n" +
                "umowa zlecenie\n" +
                "\n" +
                "\uD83D\uDCC8 ГРАФИК:\n" +
                "– 240-280 часов в месяц\n" +
                "– 2 смены по 10-12 часов\n" +
                "05:30 - 17:30\n" +
                "17:30 - 05:30\n" +
                "– 5-6 дней в неделю\n" +
                "– два перерыва по 20 минут\n" +
                "\n" +
                "\uD83D\uDD25 БОНУСЫ:\n" +
                "– ежедневно на обед можно брать выпечку\n" +
                "– каждую пятницу можно брать выпечку домой в неограниченном количестве\n" +
                "\n" +
                "\uD83C\uDFE0 ЖИЛЬЁ:\n" +
                "– 500 зл/месяц (вычитается из зарплаты)\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты на 3-4 человека\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "\uD83D\uDCB5 ЗАРПЛАТА:\n" +
                "– 20 числа\n" +
                "\n" +
                "\uD83D\uDEE0\uFE0F ОБЯЗАННОСТИ:\n" +
                "\n" +
                "Женщины:\n" +
                "– выкладка булок на ленту\n" +
                "– упаковка товаров в коробки\n" +
                "– добавление ингредиентов\n" +
                "– контроль качества\n" +
                "\n" +
                "Мужчины:\n" +
                "– укладка коробок на поддоны\n" +
                "– этикетирование\n" +
                "– возможна работа на холодном складе, в таком случае работодатель обеспечивает теплой одеждой\n" +
                "– стоячая работа\n" +
                "\n" +
                "❗\uFE0F❗\uFE0F Требования: актуальная санэпид книжка, если нет, подробно объясняем, как её оформить", "Dakri, Пекарня",true));

        vacanciesListRu.add(new Vacancies("21", "male", "rawa","✔\uFE0F Место работы: Rawa Mazowieck\n" +
                "\n" +
                "((UDT)\n" +
                "\n" +
                "Работник склада\n" +
                "– снятие паллет с регала и доставка на склад\n" +
                "– обслуживание и управление вилочным погрузчиком\n" +
                "\n" +
                "\uD83D\uDD52 График работы:\n" +
                "I смена: 06:00 – 14:00\n" +
                "II смена: 14:00 – 22:00\n" +
                "III смена: 22:00 – 06:00\n" +
                "График составляется на месяц вперед, смены чередуются еженедельно.\n" +
                "\n" +
                "\uD83D\uDCB5\uD83D\uDCB0 Ставка:\n" +
                "– 32,15 зл/час брутто\n" +
                "– 25,25 зл/час нетто до 26 лет\n" +
                "– 23,98 зл/час нетто после 26 лет\n" +
                "– от 4,67 зл/час брутто за ночные смены (в зависимости от месяца доплата может быть выше)\n" +
                "– премии за выполнение нормы\n" +
                "\n" +
                "\uD83D\uDD25 Бонусы:\n" +
                "– карта на покупки в заведении\n" +
                "– карта на обеды с балансом 100 злотых\n" +
                "\n" +
                "\uD83C\uDFE1 Жильё: комфортный дом, 3-4 человека в комнате, все удобства – 270 зл в месяц\n" +
                "\n" +
                "\uD83D\uDE8E Бесплатный доезд до работы\n" +
                "\n" +
                "\uD83D\uDCDD Umowa o pracę\n" +
                "\n" +
                "\uD83D\uDCCC Зарплата поступает на банковскую карту до 10 числа каждого месяца", "Pepco, UDT",true));

        vacanciesListRu.add(new Vacancies("22", "both", "rawa","МЕСТО РАБОТЫ: Rawa Mazowiecka (60 км от Лодзи)\n" +
                "\n" +
                "Сортировка товаров на производственной линии\n" +
                "\n" +
                "Приглашаем ответственных и трудолюбивых кандидатов на должность комплектовщика товаров в современное производственное предприятие. Вы будете работать вдоль производственной линии, где происходит комплектация товаров.\n" +
                "\n" +
                "\uD83D\uDCB0 Ставка:\n" +
                "– 28 зл/час брутто\n" +
                "– 21.97 зл/час нетто до 26 лет\n" +
                "– 21.05 зл/час нетто после 26 лет\n" +
                "– от 4.67 зл/час брутто за ночные смены (в зависимости от месяца доплата может быть выше)\n" +
                "– премии за выполнение нормы\n" +
                "\n" +
                "\uD83D\uDD25 Бонусы:\n" +
                "– карта на покупки в заведении\n" +
                "– карта на обеды с балансом 100 злотых\n" +
                "\n" +
                "\uD83C\uDFE0 ЖИЛЬЁ:\n" +
                "– 270 зл в месяц\n" +
                "\n" +
                "\uD83D\uDCC3 Umowa o pracę (160-168 часов)\n" +
                "\n" +
                "\uD83D\uDEE0\uFE0F ОБЯЗАННОСТИ:\n" +
                "– размещение товаров, поступающих по производственной линии, в специальные контейнеры\n" +
                "– аккуратное укладывание товаров на паллеты согласно установленным стандартам\n" +
                "– обмотка паллет с товарами стрейч-плёнкой для обеспечения надёжного хранения и транспортировки\n" +
                "\n" +
                "\uD83D\uDD52 График работы:\n" +
                "I смена: 06:00 – 14:00\n" +
                "II смена: 14:00 – 22:00\n" +
                "III смена: 22:00 – 06:00\n" +
                "График составляется на месяц вперёд, смены чередуются еженедельно\n" +
                "\n" +
                "❗\uFE0F Что мы предлагаем:\n" +
                "– стабильная заработная плата\n" +
                "– дружный коллектив и комфортные условия труда\n" +
                "– возможность карьерного роста\n" +
                "\n" +
                "❗\uFE0F Требования к кандидатам:\n" +
                "– ответственность и внимание к деталям\n" +
                "– способность работать в команде", "Pepco, Сортировка товаров",true));

        vacanciesListRu.add(new Vacancies("23", "male", "radomsko","Работник склада товаров для дома JYSK\n" +
                "Склад специализируется на упаковке, комплектации, сборе с помощью сканера бытовых товаров\n" +
                "\n" +
                "КРАТКО О ГЛАВНОМ\n" +
                "\uD83D\uDCB5 Зарплата 27 zł брутто\n" +
                "\uD83D\uDCC8 Работа по 8-12 часов в день\n" +
                "\uD83D\uDC6C Для мужчин до 45 лет\n" +
                "\uD83E\uDD1D Официальное трудоустройство по договору Umowa o pracę\n" +
                "\n" +
                "\uD83D\uDDC2 ТРЕБОВАНИЯ\n" +
                "◈ мужчины\n" +
                "◈ возраст до 45 лет\n" +
                "◈ Биометрия или „укр. паспорт+Pesel”\n" +
                "◈ физически здоровые\n" +
                "\n" +
                "\uD83D\uDCB3 ЗАРАБОТНАЯ ПЛАТА\n" +
                "◈ Ставка: 27 zł брутто + 25% премия\n" +
                "◈ за ночное время: +20% к ставке\n" +
                "◈ за работу в воскресенье и праздничные дни: +100% к ставке\n" +
                "◈ за работу в сверхурочное время: +50% к ставке\n" +
                "◈ Ставка на 1 zł выше для работников до 26 лет\n" +
                "◈ Еженедельные авансы\n" +
                "\n" +
                "\uD83D\uDCC8 ГРАФИК РАБОТЫ\n" +
                "◈ в 3 смены (6-14, 14-22, 22-6)\n" +
                "◈ + можно брать сверхурочные\n" +
                "\n" +
                "\uD83D\uDCDC ОБЯЗАННОСТИ\n" +
                "◈ приём товара\n" +
                "◈ комплектация на поддоны\n" +
                "◈ погрузка товаров\n" +
                "◈ работа со сканером, все сотрудники пользуются погрузчиками (до 30 см)\n" +
                "◈ Лица с нарушением зрения должны иметь очки\n" +
                "\n" +
                "\uD83C\uDFE0 ПРОЖИВАНИЕ\n" +
                "◈ предоставляется работодателем\n" +
                "◈ коммунальные услуги 260 зл/мес\n" +
                "◈ сотрудники живут в домах, квартирах\n" +
                "◈ хорошие условия, в комнате проживает 2-4 человека\n" +
                "◈ есть всё необходимое для жизни и отдыха, WI-FI, холодильник\n" +
                "◈ До работы: городской автобус курсирует на 3 смены\n" +
                "\n" +
                "ℹ\uFE0F ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ\n" +
                "◈ праздничный завтрак/ужин, сладкие подарки на День Святого Николая\n" +
                "◈ за 7 zł обеды (первое, второе), кофе/чай бесплатные. Работодатель дофинансирует 17 zł\n" +
                "◈ оплачиваемый отпуск и больничные\n" +
                "\n" +
                "\uD83D\uDCCD МЕСТО РАБОТЫ\n" +
                "◈ г. Radomsko (40 км от Ченстоховы, 100 км от Лодзи)", "Jusk, Упаковка товаров",true));

        vacanciesListRu.add(new Vacancies("24", "male", "wroclaw","\nDPD Wroclaw adresa\n" +
                "Oddział WR1\n" +
                "51-317 Wrocław, ul. Bierutowska 81\n" +
                "\n" +
                "ДОЛЖНОСТЬ: работник почтового склада\n" +
                "\n" +
                "ОПЛАТА: – 28.50 зл/час нетто для студентов до 26 лет\n" +
                "– 23.01 зл/нетто для тех, кто старше 26 лет\n" +
                "– премия в размере 2 зл/час брутто, если нет пропусков.\n" +
                "\n" +
                "ВИД ТРУДОУСТРОЙСТВА: umowa zlecenie\n" +
                "\n" +
                "ГРАФИК: – 200-280 часов в месяц\n" +
                "– смена с 18:00 до 04:00\n" +
                "– рабочие часы могут меняться в зависимости от производственных требований\n" +
                "– 5-6 дней в неделю\n" +
                "– воскресенье по желанию\n" +
                "– перерывы: 1 * 30 минут + 2 * 15 минут\n" +
                "\n" +
                "ЖИЛЬЁ: – 500 зл в месяц\n" +
                "– квартиры или дома с очень хорошими условиями проживания\n" +
                "– комнаты 3-4х местные\n" +
                "– WI-FI, все удобства\n" +
                "\n" +
                "Предоставляем транспорт от жилья до работы – 100 зл в месяц\n" +
                "\n" +
                "ДОПОЛНИТЕЛЬНЫЕ БОНУСЫ: – бесплатные обеды\n" +
                "\n" +
                "ЗАРПЛАТА: – 20 числа\n" +
                "\n" +
                "ОБЯЗАННОСТИ: – машина подъезжает к линии с посылками, и сотрудники склада загружают машину\n" +
                "– или загруженная машина подъезжает к линии, и сотрудники разгружают её на линию\n" +
                "– вес посылок от 300 грамм до 40 кг\n" +
                "\n" +
                "РАСХОДЫ: – 260 зл – обувь, одежда (однократно из зарплаты)", "DPD, Почтовый склад",true));


    }

    // Метод для пошуку вакансій за гендером та містом
    public static List<Vacancies> searchVacancies(String gender, String city, String language) {
        List<Vacancies> result = new ArrayList<>();
        if(language.equals("ua")) {
            for (Vacancies vacancy : vacanciesListUa) {
                if (vacancy.getGender().equalsIgnoreCase(gender) && vacancy.getCity().equalsIgnoreCase(city)) {
                    result.add(vacancy);
                }
            }
        }else{
            for (Vacancies vacancy : vacanciesListRu) {
                if (vacancy.getGender().equalsIgnoreCase(gender) && vacancy.getCity().equalsIgnoreCase(city)) {
                    result.add(vacancy);
                }
            }
        }
        return result;
    }
}

